<!-- placeholder-1 -->
```fish
terraform plan -chdir=. -refresh=true
```
<!-- placeholder-2 -->

<details open><summary>Diff of 6 changes.</summary>

```diff
# tailscale_tailnet_key.tailscale_key has been deleted
+ tailscale_tailnet_key.tailscale_key will be created
! module.debian13.proxmox_virtual_environment_vm.vm_template will be updated in-place
! module.ubuntu22.proxmox_virtual_environment_vm.vm_template will be updated in-place
! module.vm_minimal_config.proxmox_virtual_environment_vm.vm must be replaced
! module.vm_minimal_config.module.cloud_init_files.proxmox_virtual_environment_file.ci_user_data[0] must be replaced
! module.vm_minimal_config.module.cloud_init_files.random_id.random_id must be replaced
```
</details>
<!-- placeholder-3 -->
<details><summary>Plan: 4 to add, 2 to change, 3 to destroy.</br>

<!-- placeholder-4 -->
###### By @b- at 2025-08-11T03:16:14Z [(view log)](https://github.com/perchnet/p/actions/runs/16870050856/job/47783005327#step:11:1).
</summary>

```hcl

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply" which may have affected this plan:

  # tailscale_tailnet_key.tailscale_key has been deleted
  - resource "tailscale_tailnet_key" "tailscale_key" {
        id            = "kBq7QjFYCk11CNTRL"
      - key           = (sensitive value) -> null
        tags          = [
            "tag:web-ingress",
        ]
        # (9 unchanged attributes hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # tailscale_tailnet_key.tailscale_key will be created
  + resource "tailscale_tailnet_key" "tailscale_key" {
      + created_at    = (known after apply)
      + ephemeral     = false
      + expires_at    = (known after apply)
      + expiry        = 600
      + id            = (known after apply)
      + invalid       = (known after apply)
      + key           = (sensitive value)
      + preauthorized = true
      + reusable      = true
      + tags          = [
          + "tag:web-ingress",
        ]
      + user_id       = (known after apply)
    }

  # module.debian13.proxmox_virtual_environment_vm.vm_template will be updated in-place
  ~ resource "proxmox_virtual_environment_vm" "vm_template" {
      - description             = "Terraform generated template on 2025-08-11T02:50:17Z" -> null
        id                      = "9013"
        name                    = "debian13"
        tags                    = [
            "debian",
            "template",
            "terraform",
        ]
        # (28 unchanged attributes hidden)

        # (5 unchanged blocks hidden)
    }

  # module.ubuntu22.proxmox_virtual_environment_vm.vm_template will be updated in-place
  ~ resource "proxmox_virtual_environment_vm" "vm_template" {
      - description             = "Terraform generated template on 2025-08-11T02:50:17Z" -> null
        id                      = "8022"
        name                    = "ubuntu22"
        tags                    = [
            "template",
            "terraform",
            "ubuntu",
        ]
        # (28 unchanged attributes hidden)

        # (5 unchanged blocks hidden)
    }

  # module.vm_minimal_config.proxmox_virtual_environment_vm.vm must be replaced
-/+ resource "proxmox_virtual_environment_vm" "vm" {
      ~ id                      = "131" -> (known after apply)
      ~ ipv4_addresses          = [] -> (known after apply)
      ~ ipv6_addresses          = [] -> (known after apply)
      ~ mac_addresses           = [
          - "BC:24:11:94:80:06",
        ] -> (known after apply)
        name                    = "vm-ubuntu22-minimal"
      ~ network_interface_names = [] -> (known after apply)
      ~ vm_id                   = 131 -> (known after apply)
        # (23 unchanged attributes hidden)

      ~ clone {
          ~ full         = true -> false # forces replacement
            # (4 unchanged attributes hidden)
        }

      ~ cpu {
          - flags        = [] -> null
            # (9 unchanged attributes hidden)
        }

      ~ disk {
          ~ path_in_datastore = "vm-131-disk-0" -> (known after apply)
            # (14 unchanged attributes hidden)
        }

      ~ initialization {
          - interface            = "ide2" -> null
          + meta_data_file_id    = (known after apply)
          + network_data_file_id = (known after apply)
          ~ type                 = "nocloud" -> (known after apply)
          + user_data_file_id    = (known after apply)
          + vendor_data_file_id  = (known after apply)
            # (1 unchanged attribute hidden)

          + dns {
              + servers = []
            }

            # (2 unchanged blocks hidden)
        }

      ~ network_device {
          - disconnected = false -> null
          ~ mac_address  = "BC:24:11:94:80:06" -> (known after apply)
            # (9 unchanged attributes hidden)
        }

        # (4 unchanged blocks hidden)
    }

  # module.vm_minimal_config.module.cloud_init_files.proxmox_virtual_environment_file.ci_user_data[0] must be replaced
-/+ resource "proxmox_virtual_environment_file" "ci_user_data" {
      + file_modification_date = (known after apply)
      ~ file_name              = "944ff106c83dcdd4.user-data.yaml" -> (known after apply)
      + file_size              = (known after apply)
      + file_tag               = (known after apply)
      ~ id                     = "snippets:snippets/944ff106c83dcdd4.user-data.yaml" -> (known after apply)
        # (5 unchanged attributes hidden)

      ~ source_raw {
          ~ data      = (sensitive value) # forces replacement
          ~ file_name = "944ff106c83dcdd4.user-data.yaml" -> (known after apply) # forces replacement
            # (1 unchanged attribute hidden)
        }
    }

  # module.vm_minimal_config.module.cloud_init_files.random_id.random_id must be replaced
-/+ resource "random_id" "random_id" {
      ~ b64_std     = "lE/xBsg9zdQ=" -> (known after apply)
      ~ b64_url     = "lE_xBsg9zdQ" -> (known after apply)
      ~ dec         = "10687025452205067732" -> (known after apply)
      ~ hex         = "944ff106c83dcdd4" -> (known after apply)
      ~ id          = "lE_xBsg9zdQ" -> (known after apply)
      ~ keepers     = { # forces replacement
          # Warning: this attribute value will no longer be marked as sensitive
          # after applying this change.
          ~ "combined_ci_hash"                    = (sensitive value)
          # Warning: this attribute value will no longer be marked as sensitive
          # after applying this change.
          ~ "short_ci_user_data_contents_hash"    = (sensitive value)
            # (3 unchanged elements hidden)
        }
        # (1 unchanged attribute hidden)
    }

Plan: 4 to add, 2 to change, 3 to destroy.
```
</details>
<!-- placeholder-5 -->
<!-- terraform-44-3eee8c84341b95e00d4d4dd1307a8268.tfplan -->
<!-- placeholder-6 -->